/*
*********************************************************************************************************
*
*	模块名称 : main模块
*	文件名称 : main.h
*	版    本 : V1.0
*
*********************************************************************************************************
*/

#ifndef _MAIN_H_
#define _MAIN_H_

/* 用于LCD界面标题 */
#define VER_INFO	"安徽养和医疗器械设备有限公司 (V1.0)"

/* 主程序状态字定义, MS = Main Status */
enum
{
	MS_MAIN_MENU = 0,	/* 主界面 */
	MS_MEASURETURE,	/* 样品检测 */
	MS_QC,		
	MS_PREFERENCES,
	MS_RECORD,
	MS_PRINT,
	MS_MAINTAINING
};

#endif

/***************************** END OF FILE *********************************/

